# lockedToTruss Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TrussMemberInfo..::..lockedToTruss Property
TrussMemberInfo Class See Also
---
Whether the member is locked to the host truss.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool lockedToTruss { get; set; }
```

Visual Basic
---
```text
Public Property lockedToTruss As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool lockedToTruss {
	bool get ();
	void set (bool value);
}
```

# See Also
TrussMemberInfo Class
Autodesk.Revit.DB.Structure Namespace